In [3]:
# Pandas Advance V4: 
import pandas as pd
import numpy as np
from IPython.display import display

In [4]:
df=pd.DataFrame({ "description":["Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer sed augue nec urna gravida luctus. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Donec vel nisl at orci aliquet fermentum sit amet ut quam."]})
# display(df)

# here we can't see the whole text to resolve this issue we will use some pandas property that is : pd.set_option( )
pd.set_option('display.max_colwidth',1000) # the parameter is for charactor ( alphabets)

pd.set_option('display.max_rows',1000)
display(df)
df["char_len"]=df["description"].apply(lambda x : len(x))
display(df)

# how to count the lenth of the words in the sentence using lambda and split and len function
df["Word_count"]=df["description"].apply(lambda x: len(x.split()))
display(df)

data= { "text":["i am abhishek kushwaha ","domain is machine learning ","pandas advanve v4"]}
a=pd.DataFrame(data)
display(a)

# lets play with data frame 
# if you want to turn all the text in upper or lower case then
a=pd.DataFrame(a["text"].str.upper())
display(a)

# you can perform all the string operation on this
# display(a["text"].startswith("I")) this raise error because you did't specified the position 
display(a["text"][0].startswith("I"))

                                                                                                                                                                                                                                                    description
0  Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer sed augue nec urna gravida luctus. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Donec vel nisl at orci aliquet fermentum sit amet ut quam.

,description,char_len
0,"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer sed augue nec urna gravida luctus. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Donec vel nisl at orci aliquet fermentum sit amet ut quam.",252

,description,char_len,Word_count
0,"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer sed augue nec urna gravida luctus. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Donec vel nisl at orci aliquet fermentum sit amet ut quam.",252,39

                          text
0      i am abhishek kushwaha
1  domain is machine learning
2            pandas advanve v4

                          text
0      I AM ABHISHEK KUSHWAHA
1  DOMAIN IS MACHINE LEARNING
2            PANDAS ADVANVE V4

True

In [29]:
# df1=pd.DataFrame({"a":[1,2,3,4,5],"b":[4,5,7,8,9]})
df1=pd.DataFrame({"a":np.random.randint(1,20,5),"b":np.random.randint(1,20,5)})
display(df1)

# some operation on the data frame
# multiplication of both column
df1["multiple_of_col"]=df1["a"]*df1["b"]
display(df1)

# avg of the column (mean)
display(df1.a.mean())
# display(df1.a.median()) # arrange all the value in ascending order and the mid value will be median


df2=pd.DataFrame({"a":np.random.randint(1,10,8)})
# display(df2)
display(df2.a.rolling(window=2).mean())

# you can perfom arithmatic operation like sum , max,min,mean,median
""" window argument is neccessary in the rolling function"""
df2["Group"]=np.random.choice(["A","B"],size=8)
display(df2)

# use of groupby
display(df2.groupby("Group")["a"].sum())

    a   b
0   6  10
1   4   5
2   9   5
3  16  19
4   7  19

    a   b  multiple_of_col
0   6  10               60
1   4   5               20
2   9   5               45
3  16  19              304
4   7  19              133

np.float64(8.4)

0    NaN
1    4.5
2    2.5
3    2.5
4    5.0
5    4.5
6    3.5
7    4.0
Name: a, dtype: float64

   a Group
0  5     A
1  4     A
2  1     B
3  4     B
4  6     A
5  3     A
6  4     A
7  4     A

Group
A    26
B     5
Name: a, dtype: int32

In [ ]:
# Date time concept in pandas
time=pd.DataFrame({"Date":['2001-08-15',"2022-09-07","2025-09-11"]})
# kyuki humne ese data frame me store kiya hai to ye date na hoke as object treat hoga
# time.dtypes

# if you want to convert any column into date time then it is possible but if it is possible then it will be otherwise i won't 
time["Date"] = pd.to_datetime(time["Date"])
display(time)
display(time.dtypes)

# from here you can access date month and year
display(time["Date"].dt.month)

# just like numpy random number we can also generate the date also
time2=pd.DataFrame({"Date":pd.date_range(start= '2024-9-6',end='2025-9-11',freq='M')}) # it will show last date of each month date between given dates
display(time2)

        Date
0 2001-08-15
1 2022-09-07
2 2025-09-11

Date    datetime64[ns]
dtype: object

0    8
1    9
2    9
Name: Date, dtype: int32

C:\Users\faisal\AppData\Local\Temp\ipykernel_15652\2485072317.py:15: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  time2=pd.DataFrame({"Date":pd.date_range(start= '2024-9-6',end='2025-9-11',freq='M')})

         Date
0  2024-09-30
1  2024-10-31
2  2024-11-30
3  2024-12-31
4  2025-01-31
5  2025-02-28
6  2025-03-31
7  2025-04-30
8  2025-05-31
9  2025-06-30
10 2025-07-31
11 2025-08-31